#language: ru

@tree

Функционал: Ввод на основании контрагента

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
    И я закрываю все окна клиентского приложения
	
Структура сценария: Ввод на основании контрагента

Когда В командном интерфейсе я выбираю "Продажи" "Контрагенты"
Тогда открылось окно "Контрагенты"

Когда в таблице 'Список' я перехожу к строке:
		| "Наименование" |
		| <ИмяПапки>     |
И в таблице 'Список' я выбираю текущую строку

Когда в таблице 'Список' я перехожу к строке:
	 | "Наименование" |
	 | <ИмяПартнера>  |
И в таблице 'Список' я выбираю текущую строку
И я нажимаю на кнопку с именем <ИмяКнопкиНаОсновании>
Тогда открылось окно <ЗаголовокНовогоДокумента>

Когда я закрываю окно <ЗаголовокНовогоДокумента>
Тогда я жду закрытия окна <ЗаголовокНовогоДокумента> в течение 10 секунд

Примеры:

  | ИмяПапки     | ИмяПартнера       | ИмяКнопкиНаОсновании                          | ЗаголовокНовогоДокумента         |
  | "Поставщики" | "Мосхлеб ОАО"     | "ФормаДокументПриходТовараСоздатьНаОсновании" | "Поступление товара (создание)*" |
  | "Покупатели" | "Магазин "Обувь"" | "ФормаДокументЗаказСоздатьНаОсновании"        | "Заказ (создание)*"              |



