#language: ru

@tree

Функционал: Проверка формы подбора

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Структура сценария: У документов продажи открывается специальная форма подбора товаров

	Когда В командном интерфейсе я выбираю "Продажи"  <ВидДокумента>
	Когда я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно <ЗаголовокФормыДокумента>
"
	Когда в таблице 'Товары' я нажимаю на кнопку с именем 'КомандаПодбор'
	Тогда открылось окно "Подбор товара"

	Когда я в таблице "СписокТоваров" выбираю товар "Обувь" "Босоножки"
        И в таблице 'СписокТоваров' я перехожу к строке
            | "Наименование" |
            | "Обувь"        |
        И в таблице 'СписокТоваров' я выбираю текущую строку
        И в таблице 'СписокТоваров' я перехожу к строке
            | "Наименование" |
            | "Босоножки"    |
        И в таблице 'СписокТоваров' я выбираю текущую строку

	Когда я нажимаю на кнопку с именем 'ОК'
	Тогда открылось окно <ЗаголовокФормыДокумента>
	Тогда таблица 'Товары' стала равной:
		| 'Товар'     | 'Количество' |
		| 'Босоножки' | <Количество> |

	И я закрываю окно <ЗаголовокФормыДокумента>
	Тогда открылось окно "1С:Предприятие"
	И я нажимаю на кнопку с именем 'Button1'

Примеры:

	| ВидДокумента | ЗаголовокФормыДокумента      | 'Количество' |
	| "Заказы"     | "Заказ (создание)*"          | '1'          |
	| "Продажи"    | "Продажа товара (создание)*" | '1,00'       |