#language: ru

@tree
Функционал: Поступленеи товара 

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий


Сценарий: Автоматизация создания документа Поступление товаров

Дано Я запоминаю значение выражения "Строка(Час(ТекущаяДата())) + Строка(Минута(ТекущаяДата())) + Строка(Секунда(ТекущаяДата()))" в переменную "УникальныйНомер"


И В командном интерфейсе я выбираю "Закупки" "Поступления товаров"
Тогда открылось окно "Поступления товаров"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Поступление товара (создание)"
И в поле с именем 'Номер' я ввожу текст ""
Тогда открылось окно "1С:Предприятие"
И я нажимаю на кнопку с именем 'Button0'
И в поле с именем 'Номер' я ввожу текст "$УникальныйНомер$"
И из выпадающего списка с именем 'Организация' я выбираю точное значение "ООО \"Товары\""
И из выпадающего списка с именем 'Склад' я выбираю точное значение "Склад отдела продаж"
И из выпадающего списка с именем 'Валюта' я выбираю точное значение "Рубли"
И из выпадающего списка с именем 'Поставщик' я выбираю точное значение "Магазин \"Бытовая техника\""
И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыТовар'
Тогда открылось окно "Товары"
И в таблице 'Список' я перехожу на один уровень вниз
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000006" | "Ботинки"      |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Поступление товара (создание)*"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличество'
И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "10,00"
И в таблице 'Товары' я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Поступление товара (создание)*" в течение 10 секунд

Тогда таблица "Список" содержит строки:
	| 'Склад'                |
	| 'Склад отдела продаж ' |


