#language: ru

@tree

Функционал: Создание нового товара


Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: создание нового товара


Дано Я запоминаю значение выражения '"Товар" + Строка(ТекущаяДата())' в переменную "НовыйТовар"


Когда В командном интерфейсе я выбираю "Товарные запасы" "Товары"
Тогда открылось окно "Товары"

Когда я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Товар (создание)"

И в поле с именем 'Наименование' я ввожу текст "$НовыйТовар$"
И в поле с именем 'Артикул' я ввожу текст "123456"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Товар (создание)" в течение 10 секунд

Тогда таблица "Список" содержит строки:
	| 'Наименование' | 'Артикул' |
	| '$НовыйТовар$' | '123456'  |



Сценарий: создание новой услуги

Дано Я запоминаю значение выражения '"Услуга"+ Строка(ТекущаяДата())' в переменную "НоваяУслуга"


Когда В командном интерфейсе я выбираю "Товарные запасы" "Товары"
Тогда открылось окно "Товары"

Когда я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Товар (создание)"

И в поле с именем 'Наименование' я ввожу текст "$НоваяУслуга$"
И я меняю значение переключателя с именем 'Вид' на "Услуга"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Товар (создание)" в течение 10 секунд

Тогда таблица "Список" содержит строки:
	| 'Наименование' |
	| '$НоваяУслуга$'       |


Сценарий: Товар без наименования

И В командном интерфейсе я выбираю "Товарные запасы" "Товары"
Тогда открылось окно "Товары"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Товар (создание)"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'

Тогда в логе сообщений TestClient есть строки:
 | 'Поле "Наименование" не заполнено' |

Сценарий: Доступность реквизитов товара

Дано Я запоминаю значение выражения '"Товар" + Строка(ТекущаяДата())' в переменную "НовыйТовар"


Когда В командном интерфейсе я выбираю "Товарные запасы" "Товары"
Тогда открылось окно "Товары"

Когда я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Товар (создание)"

Когда в поле с именем 'Наименование' я ввожу текст "$НовыйТовар$"
И я жду доступности элемента с именем "Артикул" в течение 10 секунд
Тогда я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Товар (создание)" в течение 10 секунд


Сценарий: Доступность реквизитов услуги

Дано Я запоминаю значение выражения '"Услуга" + Строка(ТекущаяДата())' в переменную "НоваяУслуга"


Когда В командном интерфейсе я выбираю "Товарные запасы" "Товары"
Тогда открылось окно "Товары"

Когда я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Товар (создание)"

Когда  в поле с именем 'Наименование' я ввожу текст "$НоваяУслуга$"
И я меняю значение переключателя с именем 'Вид' на "Услуга"
Тогда я жду недоступности элемента с именем "Артикул" в течение 10 секунд
И поле с именем 'Вес' стало недоступным
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна "Товар (создание)" в течение 10 секунд
